colors = {
    ':black': (0, 0, 0),
    ':white': (255, 255, 255),
    ':red': (255, 0, 0),
    ':green': (0, 255, 0),
    ':blue': (0, 0, 255),
    ':pink': (255, 0, 255),
    ':cyan': (0, 255, 255),
    ':yellow': (255, 255, 0),

    ':c:black': (21, 23, 32),
    ':c:red': (255, 99, 132),
    ':c:orange': (255, 159, 64),
    ':c:yellow': (255, 205, 86),
    ':c:green': (75, 192, 192),
    ':c:blue': (54, 162, 235),
    ':c:purple': (153, 102, 255),
    ':c:grey': (201, 203, 207),

    ":p:black": (0, 0, 0),
    ":p:dark-blue": (29, 43, 83),
    ":p:dark-purple": (126, 37, 83),
    ":p:dark-green": (0, 135, 81),
    ":p:brown": (171, 82, 54),
    ":p:dark-grey": (95, 87, 79),
    ":p:light-grey": (194, 195, 199),
    ":p:white": (255, 241, 232),
    ":p:red": (255, 0, 77),
    ":p:orange": (255, 163, 0),
    ":p:yellow": (255, 236, 39),
    ":p:green": (0, 228, 54),
    ":p:blue": (41, 173, 255),
    ":p:lavender": (131, 118, 156),
    ":p:pink": (255, 119, 168),
    ":p:light-peach": (255, 204, 170),
}

color_sets = {
    ':casual': (
        tuple(
            colors[c] for c in colors
            if c.startswith(':c:') and c != ':c:black'
        )
    ),
    ':pico-8': (
        tuple(
            colors[c] for c in colors
            if c.startswith(':p:') and c != ':p:black'
        )
    ),
    ':base': (
        tuple(colors[c] for c in colors if c.count(':') == 1)
    ),
    ':grayscale': (
        tuple((c, c, c) for c in range(255, 0, -32))
    ),
    ':redscale': (
        tuple((c, 0, 0) for c in range(255, 0, -32))
    ),
    ':greenscale': (
        tuple((0, c, 0) for c in range(255, 0, -32))
    ),
    ':bluescale': (
        tuple((0, 0, c) for c in range(255, 0, -32))
    ),
    ':pinkscale': (
        tuple((c, 0, c) for c in range(255, 0, -32))
    ),
    ':cyanscale': (
        tuple((0, c, c) for c in range(255, 0, -32))
    ),
    ':yellowscale': (
        tuple((c, c, 0) for c in range(255, 0, -32))
    ),
}

glyph_sets = {
    ':all': (
        '!"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKL'
        'MNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxy'
        'z{|}~⌂ ¡¢£¤¥¦§¨©ª«¬-®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆ'
        'ÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòó'
        'ôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠ'
        'ġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌō'
        'ŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹź'
        'ŻżŽžſƒơƷǺǻǼǽǾǿȘșȚțɑɸˆˇˉ˘˙˚˛˜˝;΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔ'
        'ΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρς'
        'στυφχψωϊϋόύώϐϴЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНО'
        'ПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъы'
        'ьэюяѐёђѓєѕіїјљњћќѝўџҐґ־אבגדהוזחטיךכלםמןנסעףפץ'
        'צקרשתװױײ׳״ᴛᴦᴨẀẁẂẃẄẅẟỲỳ‐‒–—―‗‘’‚‛“”„‟†‡•…‧‰′″‵'
        '‹›‼‾‿⁀⁄⁔⁴⁵⁶⁷⁸⁹⁺⁻ⁿ₁₂₃₄₅₆₇₈₉₊₋₣₤₧₪€℅ℓ№™Ω℮⅐⅑⅓⅔⅕⅖'
        '⅗⅘⅙⅚⅛⅜⅝⅞←↑→↓↔↕↨∂∅∆∈∏∑−∕∙√∞∟∩∫≈≠≡≤≥⊙⌀⌂⌐⌠⌡─│┌┐└'
        '┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬▀▁▄█▌▐░▒▓■'
        '□▪▫▬▲►▼◄◊○●◘◙◦☺☻☼♀♂♠♣♥♦♪♫✓ﬁﬂ�╪╫'
    ),
    ':english': (
        'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
        'abcdefghijklmnopqrstuvwxyz'
    ),
    ':russian': (
        'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
        'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    ),
    ':greek': (
        'ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩαβγδεζηθικλμνξοπρσςτυφχψω'
    ),
    ':numbers': (
        '0123456789'
    ),
    ':borders': (
        '─│┌┐└┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬'
    ),
    ':punctuation': (
        '{};\\/:|<>?/~`[]()*&^%$#@!'
    ),
    ':angles': (
        '┌┐└┘'
    ),
    ':c': (
        'ĆĈĊČC'
        'ćĉċčc'
    ),
}

zombatar_colors = {
    'bright': {
        ':white': (0, 0, 0),
        ':red': (358, 92, -8),
        ':pink': (312, 64, -4),
        ':bright-pink': (284, 21, -2),
        ':purple': (273, 77, -6),
        ':blue': (244, 69, -6),
        ':magenta': (209, 69, -6),
        ':light-cyan': (188, 20, -2),
        ':cyan': (179, 79, -8),
        ':green': (136, 92, -15),
        ':light-green': (90, 83, -26),
        ':dark-green': (136, 89, -44),
        ':yellow': (59, 83, -4),
        ':brown': (46, 91, -12),
        ':orange': (25, 90, -6),
        ':calamansi': (59, 29, -4),
        ':coffe': (37, 48, -28),
        ':dark-red': (358, 89, -39)
    },
    'common': {
        ':white': (0, 0, 0),
        ':dark-red': (0, 78, -42),
        ':red': (0, 73, -23),
        ':orange': (22, 78, -15),
        ':calamansi': (60, 31, -2),
        ':pale-yellow': (48, 64, -7),
        ':bright-coffe': (36, 60, -36),
        ':coffe': (32, 70, -59),
        ':brown': (26, 94, -73),
        ':dark': (207, 18, -77),
        ':black': (240, 100, -97),
        ':water': (180, 17, -7),
        ':blue': (224, 74, -6),
        ':mint': (163, 94, -22),
        ':foliage-green': (69, 90, -29),
        ':light-green': (131, 86, -19),
        ':pink': (298, 72, -11),
        ':purple': (270, 77, -21)
    },
    'skin': {
        ':skin-1': (91, 17, -43),
        ':skin-2': (136, 41, -48),
        ':skin-3': (71, 30, -48),
        ':skin-4': (67, 62, 50),
        ':skin-5': (67, 35, -37),
        ':skin-6': (83, 93, -42),
        ':skin-7': (101, 62, -45),
        ':skin-8': (83, 93, -42),
        ':skin-9': (100, 41, -35),
        ':skin-10': (125, 58, -40),
        ':skin-11': (125, 40, -31),
        ':skin-12': (92, 25, -53)
    }
}

tilesets = {
    ':cross': 'img/tilesets/cross.png',
    ':tiny': 'img/tilesets/tiny.png',
    ':square': 'img/tilesets/square.png',
}

figures = {
    ':circle': {
        'width': 2,
        'height': 2,
        # Here you can make own figure samples
        # 'data': ((x, y, y_vel), (x, y, y_vel), ...)
        'data': (
            (0, 0, -1), (1, 0, 1),
            (0, 1, 1), (1, 1, -1)
        )
    },
    ':cross': {
        'width': 4,
        'height': 4,
        'data': (
            (0, 0, -1), (1, 0, 1), (2, 0, -1), (3, 0, 1),
            (0, 1, 1), (3, 1, -1), (0, 2, -1), (3, 2, 1),
            (0, 3, 1), (1, 3, -1), (2, 3, 1), (3, 3, -1)
        )
    },
}
