def resolve_glyphs(glyphs):
    glyph_sets = {
        ":all": (
            "!\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKL"
            "MNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxy"
            "z{|}~⌂ ¡¢£¤¥¦§¨©ª«¬-®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆ"
            "ÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòó"
            "ôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠ"
            "ġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌō"
            "ŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹź"
            "ŻżŽžſƒơƷǺǻǼǽǾǿȘșȚțɑɸˆˇˉ˘˙˚˛˜˝;΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔ"
            "ΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρς"
            "στυφχψωϊϋόύώϐϴЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНО"
            "ПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъы"
            "ьэюяѐёђѓєѕіїјљњћќѝўџҐґ־אבגדהוזחטיךכלםמןנסעףפץ"
            "צקרשתװױײ׳״ᴛᴦᴨẀẁẂẃẄẅẟỲỳ‐‒–—―‗‘’‚‛“”„‟†‡•…‧‰′″‵"
            "‹›‼‾‿⁀⁄⁔⁴⁵⁶⁷⁸⁹⁺⁻ⁿ₁₂₃₄₅₆₇₈₉₊₋₣₤₧₪€℅ℓ№™Ω℮⅐⅑⅓⅔⅕⅖"
            "⅗⅘⅙⅚⅛⅜⅝⅞←↑→↓↔↕↨∂∅∆∈∏∑−∕∙√∞∟∩∫≈≠≡≤≥⊙⌀⌂⌐⌠⌡─│┌┐└"
            "┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬▀▁▄█▌▐░▒▓■"
            "□▪▫▬▲►▼◄◊○●◘◙◦☺☻☼♀♂♠♣♥♦♪♫✓ﬁﬂ�╪╫"
        ),
        ":english": (
            "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
            "abcdefghijklmnopqrstuvwxyz"
        ),
        ":russian": (
            "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
            "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
        ),
        ":greek": (
            "ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩαβγδεζηθικλμνξοπρσςτυφχψω"
        ),
        ":numbers": (
            "0123456789"
        ),
        ":borders": (
            "─│┌┐└┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬"
        ),
        ":punctuation": (
            "{};\\/:|<>?/~`[]()*&^%$#@!"
        ),
        ":angles": (
            "┌┐└┘"
        ),
        ":c": (
            "ĆĈĊČC"
            "ćĉċčc"
        ),
    }

    if glyphs in glyph_sets:
        return glyph_sets[glyphs]

    return glyphs


def resolve_colors(colors):
    color_sets = {
        ":casual": [
            (255, 99, 132),
            (255, 159, 64),
            (255, 205, 86),
            (75, 192, 192),
            (54, 162, 235),
            (153, 102, 255),
            (201, 203, 207),
        ]
    }

    if isinstance(colors, str):
        if colors in color_sets:
            return color_sets[colors]

        colors = [colors]

    return [
        resolve_color(color) for color in colors
    ]

def resolve_color(color):
    colors = {
        ":red": (255, 99, 132),
        ":orange": (255, 159, 64),
        ":yellow": (255, 205, 86),
        ":green": (75, 192, 192),
        ":blue": (54, 162, 235),
        ":purple": (153, 102, 255),
        ":grey": (201, 203, 207),

        ":white": (255, 255, 255),
        ":black": (0, 0, 0),
        # ":black": (21, 23, 32),
    }

    if color in colors:
        return colors[color]

    elif color.count(',') == 2:
        return tuple(int(c) for c in color.split(','))

    else:
        print(f"Color '{color}' not found")
        exit(0)
