def resolve_glyphs(glyphs):
    glyph_sets = {
        ":all": (
            "!\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKL"
            "MNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxy"
            "z{|}~⌂ ¡¢£¤¥¦§¨©ª«¬-®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆ"
            "ÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòó"
            "ôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠ"
            "ġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌō"
            "ŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹź"
            "ŻżŽžſƒơƷǺǻǼǽǾǿȘșȚțɑɸˆˇˉ˘˙˚˛˜˝;΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔ"
            "ΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρς"
            "στυφχψωϊϋόύώϐϴЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНО"
            "ПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъы"
            "ьэюяѐёђѓєѕіїјљњћќѝўџҐґ־אבגדהוזחטיךכלםמןנסעףפץ"
            "צקרשתװױײ׳״ᴛᴦᴨẀẁẂẃẄẅẟỲỳ‐‒–—―‗‘’‚‛“”„‟†‡•…‧‰′″‵"
            "‹›‼‾‿⁀⁄⁔⁴⁵⁶⁷⁸⁹⁺⁻ⁿ₁₂₃₄₅₆₇₈₉₊₋₣₤₧₪€℅ℓ№™Ω℮⅐⅑⅓⅔⅕⅖"
            "⅗⅘⅙⅚⅛⅜⅝⅞←↑→↓↔↕↨∂∅∆∈∏∑−∕∙√∞∟∩∫≈≠≡≤≥⊙⌀⌂⌐⌠⌡─│┌┐└"
            "┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬▀▁▄█▌▐░▒▓■"
            "□▪▫▬▲►▼◄◊○●◘◙◦☺☻☼♀♂♠♣♥♦♪♫✓ﬁﬂ�╪╫"
        ),
        ":english": (
            "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
            "abcdefghijklmnopqrstuvwxyz"
        ),
        ":punctuation": (
            "{};\\/:|<>?/~`[]()*&^%$#@!"
        ),
        ":angles": (
            "┌┐└┘"
        ),
        ":borders": (
            "─│┌┐└┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬"
        ),
        ":brackets": (
            "[](){}"
        ),
        ":numbers": (
            "0123456789"
        ),
        ":c": (
            "ĆćĈĉĊċČčcC"
        ),
    }

    if glyphs in glyph_sets:
        return glyph_sets[glyphs]

    return glyphs


def resolve_colors(colors):
    colors_sets = {
        ":casual": {
            "red": (255, 99, 132),
            "orange": (255, 159, 64),
            "yellow": (255, 205, 86),
            "green": (75, 192, 192),
            "blue": (54, 162, 235),
            "purple": (153, 102, 255),
            "grey": (201, 203, 207),
        }
    }

    if colors in colors_sets:
        return colors_sets[colors]

    return colors


def resolve_color(color):
    colors_sets = {
        ":red": (255, 99, 132),
        ":orange": (255, 159, 64),
        ":yellow": (255, 205, 86),
        ":green": (75, 192, 192),
        ":blue": (54, 162, 235),
        ":purple": (153, 102, 255),
        ":grey": (201, 203, 207),

        ":white": (255, 255, 255),
        ":black": (21, 23, 32),
    }

    if color in colors_sets:
        return colors_sets[color]

    return color
